scripts/artillery-config.yml
# ============================================
# NAUTILUS ONE - LOAD TESTING CONFIGURATION
# ============================================
# Version: 3.2.0
# Tool: Artillery.io
# Usage: artillery run scripts/artillery-config.yml

config:
  target: "https://nautilus-staging.vercel.app"
  phases:
    # Warm-up phase
    - duration: 60
      arrivalRate: 5
      name: "Warm-up"
    
    # Ramp-up phase
    - duration: 120
      arrivalRate: 5
      rampTo: 50
      name: "Ramp-up"
    
    # Sustained load
    - duration: 300
      arrivalRate: 50
      name: "Sustained Load"
    
    # Spike test
    - duration: 60
      arrivalRate: 100
      name: "Spike"
    
    # Cool-down
    - duration: 60
      arrivalRate: 10
      name: "Cool-down"

  defaults:
    headers:
      Content-Type: "application/json"
      Accept: "application/json"
      User-Agent: "Artillery Load Test"

  plugins:
    expect: {}

  # Thresholds for pass/fail
  ensure:
    p95: 2000      # P95 latency < 2s
    p99: 5000      # P99 latency < 5s
    maxErrorRate: 1 # Error rate < 1%

scenarios:
  # ============================================
  # SCENARIO 1: Health Check (High frequency)
  # ============================================
  - name: "Health Check"
    weight: 3
    flow:
      - get:
          url: "/api/health"
          expect:
            - statusCode: 200

  # ============================================
  # SCENARIO 2: Landing Page Load
  # ============================================
  - name: "Landing Page"
    weight: 5
    flow:
      - get:
          url: "/"
          expect:
            - statusCode: 200

  # ============================================
  # SCENARIO 3: Dashboard Access
  # ============================================
  - name: "Dashboard Flow"
    weight: 4
    flow:
      - get:
          url: "/central-comando"
          expect:
            - statusCode:
                - 200
                - 302  # Redirect to login is OK

  # ============================================
  # SCENARIO 4: Static Assets
  # ============================================
  - name: "Static Assets"
    weight: 2
    flow:
      - get:
          url: "/favicon.ico"
          expect:
            - statusCode: 200
      - get:
          url: "/manifest.json"
          expect:
            - statusCode:
                - 200
                - 404  # May not exist

  # ============================================
  # SCENARIO 5: API Endpoints
  # ============================================
  - name: "API Stress Test"
    weight: 3
    flow:
      - get:
          url: "/roadmap"
          expect:
            - statusCode: 200
      - think: 1
      - get:
          url: "/modules"
          expect:
            - statusCode: 200

  # ============================================
  # SCENARIO 6: Compliance Module
  # ============================================
  - name: "Compliance Access"
    weight: 2
    flow:
      - get:
          url: "/peotram"
          expect:
            - statusCode:
                - 200
                - 302
      - think: 2
      - get:
          url: "/peo-dp"
          expect:
            - statusCode:
                - 200
                - 302

# ============================================
# CUSTOM METRICS
# ============================================
# After running, check these metrics:
# - http.response_time (p50, p95, p99)
# - http.requests (total)
# - http.codes.200 (success rate)
# - http.codes.5xx (server errors)
# - vusers.completed (completed sessions)
# - vusers.failed (failed sessions)